tangyangguang/Esp32_Irrigation/master-esp32/src/web/IrrigationWeb.cpp
uint32_t msToSecondsRounded(uint32_t milliseconds) {
    return (milliseconds + 999UL) / 1000UL;
}

uint8_t planEnabledZoneCount(const IrrigationConfig& config, const WateringPlan& plan) {
    uint8_t count = 0;
    for (uint8_t i = 0; i < kMaxZones; ++i) {
        if (config.zones[i].enabled && plan.zoneDurationSec[i] > 0) {
            ++count;
        }
    }
    return count;
}

uint32_t planTotalDurationSec(const IrrigationConfig& config, const WateringPlan& plan) {
    uint32_t total = 0;
    for (uint8_t i = 0; i < kMaxZones; ++i) {
        if (config.zones[i].enabled) {
            total += plan.zoneDurationSec[i];
        }
    }
    return total;
}

uint8_t zonePlanUseCount(const IrrigationConfig& config, uint8_t zoneId) {
    uint8_t count = 0;
    const uint8_t zoneIndex = zoneIndexFromId(zoneId);
    if (zoneIndex >= kMaxZones) {
        return 0;
    }
    for (uint8_t i = 0; i < kMaxPlans; ++i) {
        const WateringPlan& plan = config.plans[i];
        if (plan.used && plan.zoneDurationSec[zoneIndex] > 0) {
            ++count;
        }
    }
    return count;
}

uint8_t firstEnabledZoneId(const IrrigationConfig& config) {
    for (uint8_t i = 0; i < kMaxZones; ++i) {
        if (config.zones[i].enabled) {
            return config.zones[i].id;
        }
    }
    return 0;
}

void sendPlanStartSummary(const WateringPlan& plan) {
    bool any = false;
    for (uint8_t i = 0; i < kMaxPlanStartTimes; ++i) {
        if (!plan.startTimes[i].enabled || !isValidMinuteOfDay(plan.startTimes[i].minuteOfDay)) {
            continue;
        }
        if (any) {
            Esp32BaseWeb::sendChunk(" / ");
        }
        char text[8];
        minuteToText(plan.startTimes[i].minuteOfDay, text, sizeof(text));
        Esp32BaseWeb::sendChunk(text);
        any = true;
    }
    if (!any) {
        Esp32BaseWeb::sendChunk("未设置");
    }
}

void sendPlanZoneSummary(const IrrigationConfig& config, const WateringPlan& plan) {
    bool any = false;
    Esp32BaseWeb::sendChunk("<div class='ir-compact-list'>");
    for (uint8_t i = 0; i < kMaxZones; ++i) {
        const ZoneConfig& zone = config.zones[i];
        if (!zone.enabled || plan.zoneDurationSec[i] == 0) {
            continue;
        }
        any = true;
        Esp32BaseWeb::sendChunk("<span class='ir-compact-item'>");
        Esp32BaseWeb::writeHtmlEscaped(zone.name);
        Esp32BaseWeb::sendChunk(" ");
        char value[24];
        snprintf(value, sizeof(value), "%lu 分钟", static_cast<unsigned long>(durationMinutesRounded(plan.zoneDurationSec[i])));
        Esp32BaseWeb::sendChunk(value);
        Esp32BaseWeb::sendChunk("</span>");
    }
    if (!any) {
        Esp32BaseWeb::sendChunk("<span class='ir-table-note'>未配置有效水路时长</span>");
    }
    Esp32BaseWeb::sendChunk("</div>");
}

bool readRequestZoneId(uint8_t& zoneId) {
    return parseU8Param("id", 1, kMaxZones, zoneId);
}

bool readRequestPlanId(uint8_t& planId) {
    return parseU8Param("id", 1, kMaxPlans, planId);
}

bool readPagingParam(const char* name, uint32_t minValue, uint32_t maxValue, uint32_t fallback, uint32_t& out) {
    return parseU32Param(name, minValue, maxValue, fallback, out);
}

bool readPlanFieldsFromRequest(WateringPlan& plan) {
    char value[kPlanNameLength];
    plan.enabled = parseBoolParam("enabled");
    if (Esp32BaseWeb::getParam("name", value, sizeof(value))) {
        snprintf(plan.name, sizeof(plan.name), "%s", value);
        plan.name[sizeof(plan.name) - 1] = '\0';
    }

    for (uint8_t i = 0; i < kMaxPlanStartTimes; ++i) {
        char key[8];
        snprintf(key, sizeof(key), "se%u", i);
        const bool enabled = parseBoolParam(key);
        snprintf(key, sizeof(key), "st%u", i);
        uint16_t minuteOfDay = kInvalidMinuteOfDay;
        if (!parseMinuteParam(key, enabled, minuteOfDay)) {
            Esp32BaseWeb::sendText(400, "启动时间无效");
            return false;
        }
        plan.startTimes[i].enabled = enabled;
        plan.startTimes[i].minuteOfDay = minuteOfDay;
    }

    for (uint8_t i = 0; i < kMaxZones; ++i) {
        char key[8];
        snprintf(key, sizeof(key), "z%u", i + 1);
        uint32_t minutes = 0;
        if (!parseU32Param(key, 0, maxZoneDurationMinutes(), plan.zoneDurationSec[i] / 60UL, minutes)) {
            Esp32BaseWeb::sendText(400, "水路时长无效");
            return false;
        }
        plan.zoneDurationSec[i] = minutes * 60UL;
    }
    return true;
}

uint32_t maxZoneDurationMinutes() {
    const uint32_t seconds = ConfigStore::config().valve.maxZoneDurationSec;
    const uint32_t minutes = (seconds + 59UL) / 60UL;
    return minutes > 0 ? minutes : 1;
}

void sendStatusJson() {
    const StatusSnapshot status = RunController::statusSnapshot();
    const WateringRun& run = RunController::currentRun();

    Esp32BaseWeb::beginJson(200);
    Esp32BaseWeb::sendChunk("\"configValid\":");
    Esp32BaseWeb::sendChunk(status.configValid ? "true," : "false,");
    Esp32BaseWeb::sendChunk("\"busy\":");
    Esp32BaseWeb::sendChunk(status.busy ? "true," : "false,");
    sendJsonStringField("runState", runStateName(status.runState));
    sendJsonStringField("runResult", runResultName(status.runResult));
    Esp32BaseWeb::sendChunk("\"activeZoneId\":");
    char number[16];
    snprintf(number, sizeof(number), "%u,", status.activeZoneId);
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk("\"enabledZoneCount\":");
    snprintf(number, sizeof(number), "%u,", status.enabledZoneCount);
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk("\"enabledPlanCount\":");
    snprintf(number, sizeof(number), "%u,", status.enabledPlanCount);
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk("\"currentFlowMlPerMin\":");
    snprintf(number, sizeof(number), "%lu,", static_cast<unsigned long>(status.currentFlowMlPerMin));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk("\"currentRunVolumeMl\":");
    snprintf(number, sizeof(number), "%lu,", static_cast<unsigned long>(status.currentRunVolumeMl));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk("\"nextRunEpoch\":");
    snprintf(number, sizeof(number), "%lu,", static_cast<unsigned long>(status.nextRunEpoch));
    Esp32BaseWeb::sendChunk(number);
    sendJsonStringField("reason", runReasonToString(run.reason), false);
    Esp32BaseWeb::endJson();
}

void handleStatusApi() {
    sendStatusJson();
}

void handleZonesApi() {
    Esp32BaseWeb::beginJson(200);
    Esp32BaseWeb::sendChunk("\"zones\":[");
    const IrrigationConfig& config = ConfigStore::config();
    for (uint8_t i = 0; i < kMaxZones; ++i) {
        const ZoneConfig& zone = config.zones[i];
        if (i > 0) {
            Esp32BaseWeb::sendChunk(",");
        }
        char buf[96];
        snprintf(buf, sizeof(buf),
                 "{\"id\":%u,\"enabled\":%s,\"standardFlowMlPerMin\":%lu,\"name\":\"",
                 zone.id,
                 zone.enabled ? "true" : "false",
                 static_cast<unsigned long>(zone.standardFlowMlPerMin));
        Esp32BaseWeb::sendChunk(buf);
        Esp32BaseWeb::writeJsonEscaped(zone.name);
        Esp32BaseWeb::sendChunk("\"}");
    }
    Esp32BaseWeb::sendChunk("]");
    Esp32BaseWeb::endJson();
}

void handlePlansApi() {
    Esp32BaseWeb::beginJson(200);
    Esp32BaseWeb::sendChunk("\"plans\":[");
    const IrrigationConfig& config = ConfigStore::config();
    bool firstPlan = true;
    for (uint8_t i = 0; i < kMaxPlans; ++i) {
        const WateringPlan& plan = config.plans[i];
        if (!plan.used) {
            continue;
        }
        if (!firstPlan) {
            Esp32BaseWeb::sendChunk(",");
        }
        firstPlan = false;

        char buf[96];
        snprintf(buf, sizeof(buf), "{\"id\":%u,\"enabled\":%s,\"name\":\"", plan.id, plan.enabled ? "true" : "false");
        Esp32BaseWeb::sendChunk(buf);
        Esp32BaseWeb::writeJsonEscaped(plan.name);
        Esp32BaseWeb::sendChunk("\",\"startTimes\":[");
        bool firstStart = true;
        for (uint8_t j = 0; j < kMaxPlanStartTimes; ++j) {
            if (!plan.startTimes[j].enabled || !isValidMinuteOfDay(plan.startTimes[j].minuteOfDay)) {
                continue;
            }
            if (!firstStart) {
                Esp32BaseWeb::sendChunk(",");
            }
            firstStart = false;
            snprintf(buf, sizeof(buf), "%u", plan.startTimes[j].minuteOfDay);
            Esp32BaseWeb::sendChunk(buf);
        }
        Esp32BaseWeb::sendChunk("]}");
    }
    Esp32BaseWeb::sendChunk("]");
    Esp32BaseWeb::endJson();
}

void handleHistoryApi() {
    if (!HistoryService::readRecent(g_historyViewBuffer, sizeof(g_historyViewBuffer))) {
        Esp32BaseWeb::sendText(500, HistoryService::lastError());
        return;
    }
    Esp32BaseWeb::sendText(200, g_historyViewBuffer);
}

void handleCalibrationApi() {
    const CalibrationSnapshot snapshot = CalibrationService::snapshot();
    Esp32BaseWeb::beginJson(200);
    sendJsonStringField("mode", calibrationModeName(snapshot.mode));
    Esp32BaseWeb::sendChunk("\"running\":");
    Esp32BaseWeb::sendChunk(snapshot.running ? "true," : "false,");
    Esp32BaseWeb::sendChunk("\"resultReady\":");
    Esp32BaseWeb::sendChunk(snapshot.resultReady ? "true," : "false,");
    char buf[192];
    snprintf(buf, sizeof(buf),
             "\"runId\":%lu,\"zoneId\":%u,\"durationSec\":%lu,\"pulses\":%lu,\"computedPulsesPerLiter\":%lu,\"suggestedFlowMlPerMin\":%lu",
             static_cast<unsigned long>(snapshot.runId),
             snapshot.zoneId,
             static_cast<unsigned long>(snapshot.durationSec),
             static_cast<unsigned long>(snapshot.pulses),
             static_cast<unsigned long>(snapshot.computedPulsesPerLiter),
             static_cast<unsigned long>(snapshot.suggestedFlowMlPerMin));
    Esp32BaseWeb::sendChunk(buf);
    Esp32BaseWeb::endJson();
}

bool readDurationParam(uint8_t zoneId, uint32_t& out) {
    char key[8];
    snprintf(key, sizeof(key), "z%u", zoneId);
    uint32_t minutes = 0;
    if (!parseU32Param(key, 0, maxZoneDurationMinutes(), 0, minutes)) {
        return false;
    }
    out = minutes * 60UL;
    return true;
}

