tangyangguang/Esp32_Irrigation/master-esp32/src/web/IrrigationWeb.cpp
bool readZoneParam(uint8_t& zoneId) {
    return parseU8Param("zone", 1, kMaxZones, zoneId);
}

bool readDurationMinutesParam(uint32_t& durationSec) {
    uint32_t minutes = 0;
    if (!parseU32Param("durationMin", 1, maxZoneDurationMinutes(), 5, minutes)) {
        return false;
    }
    durationSec = minutes * 60UL;
    return true;
}

void handleManualStartPost() {
    if (!Esp32BaseWeb::checkPostAllowed("manual_start")) {
        return;
    }

    uint32_t durations[kMaxZones] = {};
    for (uint8_t i = 0; i < kMaxZones; ++i) {
        if (!readDurationParam(i + 1, durations[i])) {
            Esp32BaseWeb::sendText(400, "浇水时长无效");
            return;
        }
    }

    RunReason reason = RunReason::None;
    if (!RunController::startManual(durations, reason)) {
        Esp32BaseWeb::sendText(409, runReasonLabel(reason));
        return;
    }

    Esp32BaseWeb::redirectSeeOther("/irrigation/run");
}

void handleCalibrationPost() {
    if (!Esp32BaseWeb::checkPostAllowed("calibration")) {
        return;
    }

    char action[24];
    if (!Esp32BaseWeb::getParam("action", action, sizeof(action))) {
        Esp32BaseWeb::sendText(400, "缺少操作");
        return;
    }

    if (strcmp(action, "start_volume") == 0 || strcmp(action, "start_standard") == 0) {
        uint8_t zoneId = 0;
        uint32_t durationSec = 0;
        if (!readZoneParam(zoneId) || !readDurationMinutesParam(durationSec)) {
            Esp32BaseWeb::sendText(400, "校准请求无效");
            return;
        }

        RunReason reason = RunReason::None;
        const bool ok = strcmp(action, "start_volume") == 0 ?
            CalibrationService::startVolumeCalibration(zoneId, durationSec, reason) :
            CalibrationService::startStandardFlowCalibration(zoneId, durationSec, reason);
        if (!ok) {
            Esp32BaseWeb::sendText(409, CalibrationService::lastError());
            return;
        }
        Esp32BaseWeb::redirectSeeOther("/irrigation/calibration");
        return;
    }

    if (strcmp(action, "stop") == 0) {
        if (!CalibrationService::stop()) {
            Esp32BaseWeb::sendText(409, CalibrationService::lastError());
            return;
        }
        Esp32BaseWeb::redirectSeeOther("/irrigation/calibration");
        return;
    }

    if (strcmp(action, "save_volume") == 0) {
        uint32_t measuredMl = 0;
        if (!parseU32Param("measuredMl", 1, 100000, 0, measuredMl)) {
            Esp32BaseWeb::sendText(400, "实测水量无效");
            return;
        }
        if (!CalibrationService::savePulsesPerLiter(measuredMl)) {
            Esp32BaseWeb::sendText(400, CalibrationService::lastError());
            return;
        }
        Esp32BaseWeb::redirectSeeOther("/irrigation/calibration");
        return;
    }

    if (strcmp(action, "save_standard") == 0) {
        uint8_t zoneId = 0;
        uint32_t flow = 0;
        if (!readZoneParam(zoneId) || !parseU32Param("standardFlow", 1, 100000, 0, flow)) {
            Esp32BaseWeb::sendText(400, "标准流量无效");
            return;
        }
        if (!CalibrationService::saveZoneStandardFlow(zoneId, flow)) {
            Esp32BaseWeb::sendText(400, CalibrationService::lastError());
            return;
        }
        Esp32BaseWeb::redirectSeeOther("/irrigation/calibration");
        return;
    }

    if (strcmp(action, "clear") == 0) {
        CalibrationService::clearResult();
        Esp32BaseWeb::redirectSeeOther("/irrigation/calibration");
        return;
    }

    Esp32BaseWeb::sendText(400, "未知操作");
}

void handlePlanNowPost() {
    if (!Esp32BaseWeb::checkPostAllowed("plan_now")) {
        return;
    }
    char value[8];
    if (!Esp32BaseWeb::getParam("plan", value, sizeof(value))) {
        Esp32BaseWeb::sendText(400, "缺少计划");
        return;
    }
    uint8_t planId = 0;
    if (!parseU8Param("plan", 1, kMaxPlans, planId)) {
        Esp32BaseWeb::sendText(400, "计划无效");
        return;
    }
    RunReason reason = RunReason::None;
    if (!RunController::startPlanNow(planId, reason)) {
        Esp32BaseWeb::sendText(409, runReasonLabel(reason));
        return;
    }
    Esp32BaseWeb::redirectSeeOther("/irrigation/run");
}

void handleStopPost() {
    if (!Esp32BaseWeb::checkPostAllowed("manual_stop")) {
        return;
    }
    RunController::stop();
    Esp32BaseWeb::redirectSeeOther("/irrigation/run");
}

void handleZoneSavePost() {
    if (!Esp32BaseWeb::checkPostAllowed("zone_save")) {
        return;
    }
    if (RunController::busy()) {
        Esp32BaseWeb::sendText(409, "运行中不能修改水路");
        return;
    }

    char value[32];
    uint8_t zoneId = 0;
    if (!parseU8Param("id", 1, kMaxZones, zoneId)) {
        Esp32BaseWeb::sendText(400, "水路编号无效");
        return;
    }
    const ZoneConfig* current = ZoneService::find(zoneId);
    if (current == nullptr) {
        Esp32BaseWeb::sendText(404, ZoneService::lastError());
        return;
    }

    ZoneConfig zone = *current;
    zone.enabled = parseBoolParam("enabled");
    if (Esp32BaseWeb::getParam("name", value, sizeof(value))) {
        snprintf(zone.name, sizeof(zone.name), "%s", value);
        zone.name[sizeof(zone.name) - 1] = '\0';
    }

    uint32_t flow = 0;
    if (!parseU32Param("standardFlow", 0, 100000, zone.standardFlowMlPerMin, flow)) {
        Esp32BaseWeb::sendText(400, "标准流量无效");
        return;
    }
    zone.standardFlowMlPerMin = flow;

    if (!ZoneService::saveZone(zone)) {
        Esp32BaseWeb::sendText(400, ZoneService::lastError());
        return;
    }

    Esp32BaseWeb::redirectSeeOther("/irrigation/zones");
}

void handlePlanCreatePost() {
    if (!Esp32BaseWeb::checkPostAllowed("plan_create")) {
        return;
    }

    WateringPlan plan = {};
    plan.id = 1;
    plan.used = true;
    snprintf(plan.name, sizeof(plan.name), "新计划");
    for (uint8_t i = 0; i < kMaxPlanStartTimes; ++i) {
        plan.startTimes[i].enabled = false;
        plan.startTimes[i].minuteOfDay = kInvalidMinuteOfDay;
    }
    for (uint8_t i = 0; i < kMaxZones; ++i) {
        plan.zoneDurationSec[i] = 0;
    }
    if (!readPlanFieldsFromRequest(plan)) {
        return;
    }

    uint8_t planId = 0;
    if (!PlanService::createPlan(plan.name, planId)) {
        Esp32BaseWeb::sendText(400, PlanService::lastError());
        return;
    }
    plan.id = planId;
    if (!PlanService::savePlan(plan)) {
        PlanService::deletePlan(planId);
        Esp32BaseWeb::sendText(400, PlanService::lastError());
        return;
    }
    Esp32BaseWeb::redirectSeeOther("/irrigation/plans");
}

void handlePlanDeletePost() {
    if (!Esp32BaseWeb::checkPostAllowed("plan_delete")) {
        return;
    }
    uint8_t planId = 0;
    if (!parseU8Param("id", 1, kMaxPlans, planId)) {
        Esp32BaseWeb::sendText(400, "计划编号无效");
        return;
    }
    if (!PlanService::deletePlan(planId)) {
        Esp32BaseWeb::sendText(400, PlanService::lastError());
        return;
    }
    Esp32BaseWeb::redirectSeeOther("/irrigation/plans");
}

void handlePlanSavePost() {
    if (!Esp32BaseWeb::checkPostAllowed("plan_save")) {
        return;
    }

    uint8_t planId = 0;
    if (!parseU8Param("id", 1, kMaxPlans, planId)) {
        Esp32BaseWeb::sendText(400, "计划编号无效");
        return;
    }
    const WateringPlan* current = PlanService::find(planId);
    if (current == nullptr) {
        Esp32BaseWeb::sendText(404, PlanService::lastError());
        return;
    }

    WateringPlan plan = *current;
    if (!readPlanFieldsFromRequest(plan)) {
        return;
    }

    if (!PlanService::savePlan(plan)) {
        Esp32BaseWeb::sendText(400, PlanService::lastError());
        return;
    }

    Esp32BaseWeb::redirectSeeOther("/irrigation/plans");
}

void handleSettingsSavePost() {
    if (!Esp32BaseWeb::checkPostAllowed("settings_save")) {
        return;
    }
    if (RunController::busy()) {
        Esp32BaseWeb::sendText(409, "运行中不能修改设置");
        return;
    }

